FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_Serial.c
    InterruptDisable(p->iInfo->iInterruptChannel);

    // Ensure power is on to the part
    LPC17xx_40xxPowerOn(1UL << p->iInfo->iPowerBitIndex);
    LPC17xx_40xxPowerOn(1UL << p->iInfo->iPowerBitIndex);

    p->iReceivedByteFunc = aReceivedByteCallback;
    p->iTransmitEmptyFunc = aTransmitEmptyCallback;
    p->iCallbackWorkspace = aCallbackWorkspace;

    divider = BAUD_DIVIDER(SERIAL_PORTS_DEFAULT_BAUD);

    // Set the FIFO enable bit in the FCR register. This bit must be set for
    // proper UART operation.
    p_info->iUART->reg08.FCR = 7; // FCRFE|RFR|TFR

    // Set baudrate
    p_info->iUART->LCR |= 0x80; //DLAB enable access
    p_info->iUART->reg00.DLL = divider & 0x00ff;
    p_info->iUART->reg04.DLM = (divider >> 8) & 0x00ff;
    p_info->iUART->FDR = ((mulVal<<4) & 0x00f0) | (divAddVal & 0x000f); // fractional dividers set back to default
    p_info->iUART->LCR &= ~0x80;

    // Set default mode (8 bits, 1 stop bit, no parity)
    p_info->iUART->LCR = 0x03;

    //Enable UART0 interrupts
    p_info->iUART->reg04.IER = 0x03; // Interrupts and TX and RX

    InterruptRegister(p_info->iInterruptChannel, p_info->iISR,
            p_info->iPriority, p->iHAL->iInterface.iName);

    //TBD: For now, leave serial port deactivated
      //  InterruptEnable(p_info->iInterruptChannel);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC17xx_40xx_Serial_SetSerialSettings
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the serial port settings
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 *      T_Serial_Settings *aSettings -- Settings to use for serial port
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_Serial_SetSerialSettings(
        void *aWorkspace,
        T_Serial_Settings *aSettings)
{
    T_Serial_LPC17xx_40xx_Workspace *p = (T_Serial_LPC17xx_40xx_Workspace *)aWorkspace;
    const T_Serial_LPC17xx_40xx_SerialInfo *p_info = p->iInfo;
    TUInt32 divider;

    // Record these settings
    p->iSettings = *aSettings;

    //TBD: Do the other settings!

    // Change the baud rate
    divider = BAUD_DIVIDER(aSettings->iBaud);
    p_info->iUART->LCR |= 0x80;
    p_info->iUART->reg00.DLL = divider & 0x00ff;
    p_info->iUART->reg04.DLM = (divider >> 8) & 0x00ff;
    p_info->iUART->LCR &= 0x00;

    switch (aSettings->iParity) {
        case SERIAL_PARITY_ODD:
            p_info->iUART->LCR |= ((1 << 3) | (0 << 4));
            break;
        case SERIAL_PARITY_EVEN:
            p_info->iUART->LCR |= ((1 << 3) | (1 << 4));
            break;
        case SERIAL_PARITY_MARK:
            p_info->iUART->LCR |= ((1 << 3) | (2 << 4));
            break;
        case SERIAL_PARITY_SPACE:
            p_info->iUART->LCR |= ((1 << 3) | (3 << 4));
            break;
        case SERIAL_PARITY_NONE:
            p_info->iUART->LCR |= ((0 << 3) | (0 << 4));
            break;
        default:
            return UEZ_ERROR_INVALID_PARAMETER;
    }

    switch (aSettings->iStopBit) {
        case SERIAL_STOP_BITS_1:
            p_info->iUART->LCR |= (0 << 2);
            break;
        case SERIAL_STOP_BITS_2:
            p_info->iUART->LCR |= (1 << 2);
            break;
        case SERIAL_STOP_BITS_1_POINT_5:
            return UEZ_ERROR_NOT_SUPPORTED;
        default:
            return UEZ_ERROR_INVALID_PARAMETER;
    }

    switch (aSettings->iWordLength) {
        case 5:
            p_info->iUART->LCR |= (0 << 0);
            break;
        case 6:
            p_info->iUART->LCR |= (1 << 0);
            break;
        case 7:
            p_info->iUART->LCR |= (2 << 0);
            break;
        case 8:
            p_info->iUART->LCR |= (3 << 0);
            break;
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
    }
	
        // MCR and flow control pins not present on UART 0, 2, or 3!
	switch (aSettings->iFlowControl) {
        case SERIAL_FLOW_CONTROL_NONE:
            // default register settings are for none, need to test setting it back
            //p_info->iUART->MCR |= ~(1 << 6); // Disable auto RTS
            //p_info->iUART->MCR |= ~(1 << 7); // Disable auto CTS
            break;
        case SERIAL_FLOW_CONTROL_XON_XOFF:
            return UEZ_ERROR_NOT_SUPPORTED; // TODO
        case SERIAL_FLOW_CONTROL_HARDWARE:
			return UEZ_ERROR_NOT_SUPPORTED; // TODO, example config from 43xx
            //p_info->iUART->MCR |= (1 << 6); // Auto RTS enable bit
            //p_info->iUART->MCR |= (1 << 7); // Auto CTS enable bit
            //break;			
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
    }    

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC17xx_40xx_Serial_GetSerialSettings
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the previously configured serial port
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 *      T_Serial_Settings *aSettings -- Settings used for serial port
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_Serial_GetSerialSettings(
        void *aWorkspace,
        T_Serial_Settings *aSettings)
{
    T_Serial_LPC17xx_40xx_Workspace *p = (T_Serial_LPC17xx_40xx_Workspace *)aWorkspace;

    // Record these settings
    *aSettings = p->iSettings;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC17xx_40xx_Serial_SetHandshakingControl
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the handshaking control for this serial port (if it has it)
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 *      T_serialHandshakingControl -- Control bits to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_Serial_SetHandshakingControl(
        void *aWorkspace,
        T_serialHandshakingControl aControl)
{
    T_Serial_LPC17xx_40xx_Workspace *p = (T_Serial_LPC17xx_40xx_Workspace *)aWorkspace;
    const T_Serial_LPC17xx_40xx_SerialInfo *p_info = p->iInfo;

