FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_Serial.c
    p_info->iUART->MCR = (aControl & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC17xx_40xx_Serial_GetHandshakingStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the handshaking control for this serial port (if it has it)
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 *      T_serialHandshakingStatus *aStatus -- Current status
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_Serial_GetHandshakingStatus(
        void *aWorkspace,
        T_serialHandshakingStatus *aStatus)
{
    T_Serial_LPC17xx_40xx_Workspace *p = (T_Serial_LPC17xx_40xx_Workspace *)aWorkspace;
    const T_Serial_LPC17xx_40xx_SerialInfo *p_info = p->iInfo;

    *aStatus = (p_info->iUART->MSR & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC17xx_40xx_Serial_GetStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the status of the port
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 * Outputs:
 *      T_serialStatusByte          -- Status byte returned
 *---------------------------------------------------------------------------*/
T_serialStatusByte LPC17xx_40xx_Serial_GetStatus(void *aWorkspace)
{
    T_serialStatusByte status = 0;
    T_Serial_LPC17xx_40xx_Workspace *p = (T_Serial_LPC17xx_40xx_Workspace *)aWorkspace;

    // Only empty if both TEMT and THRE are empty
    if (p->iInfo->iUART->LSR & ((1 << 6) | (1 << 5))) {
        // not empty
    } else {
        status |= SERIAL_STATUS_TRANSMIT_EMPTY;
    }

    return status;
}

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
// List of serial port HAL interfaces
const HAL_Serial G_LPC17xx_40xx_Serial_UART0 = {
        {
        "Serial:LPC1788 UART0",
        0x0100,
        LPC17xx_40xx_Serial_InitializeWorkspace_UART0,
        sizeof(T_Serial_LPC17xx_40xx_Workspace),
        },

        LPC17xx_40xx_Serial_Configure,
        LPC17xx_40xx_Serial_SetSerialSettings,
        LPC17xx_40xx_Serial_GetSerialSettings,
        LPC17xx_40xx_Serial_Activate,
        LPC17xx_40xx_Serial_Deactivate,
        LPC17xx_40xx_Serial_OutputByte,
        0,
        0,
        LPC17xx_40xx_Serial_GetStatus, };

const HAL_Serial G_LPC17xx_40xx_Serial_UART1 = {
        {
        "Serial:LPC1788 UART1",
        0x0100,
        LPC17xx_40xx_Serial_InitializeWorkspace_UART1,
        sizeof(T_Serial_LPC17xx_40xx_Workspace),
        },

        LPC17xx_40xx_Serial_Configure,
        LPC17xx_40xx_Serial_SetSerialSettings,
        LPC17xx_40xx_Serial_GetSerialSettings,
        LPC17xx_40xx_Serial_Activate,
        LPC17xx_40xx_Serial_Deactivate,
        LPC17xx_40xx_Serial_OutputByte,
        LPC17xx_40xx_Serial_SetHandshakingControl,
        LPC17xx_40xx_Serial_GetHandshakingStatus,
        LPC17xx_40xx_Serial_GetStatus, };

const HAL_Serial G_LPC17xx_40xx_Serial_UART2 = {
        {
        "Serial:LPC1788 UART2",
        0x0100,
        LPC17xx_40xx_Serial_InitializeWorkspace_UART2,
        sizeof(T_Serial_LPC17xx_40xx_Workspace),
        },

        LPC17xx_40xx_Serial_Configure,
        LPC17xx_40xx_Serial_SetSerialSettings,
        LPC17xx_40xx_Serial_GetSerialSettings,
        LPC17xx_40xx_Serial_Activate,
        LPC17xx_40xx_Serial_Deactivate,
        LPC17xx_40xx_Serial_OutputByte,
        0,
        0,
        LPC17xx_40xx_Serial_GetStatus, };

const HAL_Serial G_LPC17xx_40xx_Serial_UART3 = {
        {
        "Serial:LPC1788 UART3",
        0x0100,
        LPC17xx_40xx_Serial_InitializeWorkspace_UART3,
        sizeof(T_Serial_LPC17xx_40xx_Workspace),
        },

        LPC17xx_40xx_Serial_Configure,
        LPC17xx_40xx_Serial_SetSerialSettings,
        LPC17xx_40xx_Serial_GetSerialSettings,
        LPC17xx_40xx_Serial_Activate,
        LPC17xx_40xx_Serial_Deactivate,
        LPC17xx_40xx_Serial_OutputByte,
        0,
        0,
        LPC17xx_40xx_Serial_GetStatus, };
	
const HAL_Serial G_LPC17xx_40xx_Serial_UART4 = {
        {
        "Serial:LPC1788 UART4",
        0x0100,
        LPC17xx_40xx_Serial_InitializeWorkspace_UART4,
        sizeof(T_Serial_LPC17xx_40xx_Workspace),
        },

        LPC17xx_40xx_Serial_Configure,
        LPC17xx_40xx_Serial_SetSerialSettings,
        LPC17xx_40xx_Serial_GetSerialSettings,
        LPC17xx_40xx_Serial_Activate,
        LPC17xx_40xx_Serial_Deactivate,
        LPC17xx_40xx_Serial_OutputByte,
        0,
        0,
        LPC17xx_40xx_Serial_GetStatus, };

const T_Serial_LPC17xx_40xx_SerialInfo G_LPC17xx_40xx_Serial_Info_UART0 = {
        UART0_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART0_BASE,
        (TISRFPtr)ISerialUART0,
        3, // PCUART0
        };

const T_Serial_LPC17xx_40xx_SerialInfo G_LPC17xx_40xx_Serial_Info_UART1 = {
        UART1_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART1_BASE,
        (TISRFPtr)ISerialUART1,
        4, // PCUART1
        };

const T_Serial_LPC17xx_40xx_SerialInfo G_LPC17xx_40xx_Serial_Info_UART2 = {
        UART2_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART2_BASE,
        (TISRFPtr)ISerialUART2,
        24, // PCUART2
        };

const T_Serial_LPC17xx_40xx_SerialInfo G_LPC17xx_40xx_Serial_Info_UART3 = {
        UART3_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART3_BASE,
        (TISRFPtr)ISerialUART3,
        25, // PCUART3
        };

const T_Serial_LPC17xx_40xx_SerialInfo G_LPC17xx_40xx_Serial_Info_UART4 = {
        UART4_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART4_BASE,
        (TISRFPtr)ISerialUART4,
        8, // PCUART4
        };
	
/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC17xx_40xx_UART0_Require(
        T_uezGPIOPortPin aPinTXD0,
        T_uezGPIOPortPin aPinRXD0)
{
    static const T_LPC17xx_40xx_IOCON_ConfigList txd0[] = {
            {GPIO_P0_0,   IOCON_D_DEFAULT(4)},
            {GPIO_P0_2,   IOCON_D_DEFAULT(1)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList rxd0[] = {
            {GPIO_P0_1,   IOCON_D_DEFAULT(4)},
            {GPIO_P0_3,   IOCON_D_DEFAULT(1)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART0", (T_halInterface *)&G_LPC17xx_40xx_Serial_UART0, 0,
            0);
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinTXD0, txd0, ARRAY_COUNT(txd0));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinRXD0, rxd0, ARRAY_COUNT(rxd0));
}

void LPC17xx_40xx_UART1_Require(
        T_uezGPIOPortPin aPinTXD1,
        T_uezGPIOPortPin aPinRXD1,
        T_uezGPIOPortPin aPinCTS,
        T_uezGPIOPortPin aPinDCD,
        T_uezGPIOPortPin aPinDSR,
        T_uezGPIOPortPin aPinDTR,
        T_uezGPIOPortPin aPinRI,
        T_uezGPIOPortPin aPinRTS)
{
    static const T_LPC17xx_40xx_IOCON_ConfigList txd1[] = {
            {GPIO_P0_15, IOCON_D_DEFAULT(1)},
            {GPIO_P2_0,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_16, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList rxd1[] = {
            {GPIO_P0_16, IOCON_D_DEFAULT(1)},
            {GPIO_P2_1,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_17, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList cts[] = {
            {GPIO_P0_17, IOCON_D_DEFAULT(1)},
            {GPIO_P2_2,  IOCON_D_DEFAULT(2)},
            {GPIO_P2_8,  IOCON_D_DEFAULT(3)},
            {GPIO_P3_18, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList dcd[] = {
            {GPIO_P0_18, IOCON_D_DEFAULT(1)},
            {GPIO_P2_3,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_19, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList dsr[] = {
            {GPIO_P0_19, IOCON_D_DEFAULT(1)},
            {GPIO_P2_4,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_20, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList dtr[] = {
            {GPIO_P0_20, IOCON_D_DEFAULT(1)},
            {GPIO_P2_5,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_21, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList ri[] = {
            {GPIO_P0_21, IOCON_D_DEFAULT(1)},
            {GPIO_P2_6,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_22, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList rts[] = {
            {GPIO_P0_6,  IOCON_D_DEFAULT(4)},
            {GPIO_P0_22, IOCON_D_DEFAULT(1)},
            {GPIO_P2_7,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_30, IOCON_D_DEFAULT(3)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART1", (T_halInterface *)&G_LPC17xx_40xx_Serial_UART1, 0,
            0);
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinTXD1, txd1, ARRAY_COUNT(txd1));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinRXD1, rxd1, ARRAY_COUNT(rxd1));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinCTS, cts, ARRAY_COUNT(cts));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinDCD, dcd, ARRAY_COUNT(dcd));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinDSR, dsr, ARRAY_COUNT(dsr));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinDTR, dtr, ARRAY_COUNT(dtr));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinRI, ri, ARRAY_COUNT(ri));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinRTS, rts, ARRAY_COUNT(rts));
}

void LPC17xx_40xx_UART2_Require(
        T_uezGPIOPortPin aPinTXD2,
        T_uezGPIOPortPin aPinRXD2)
{
    static const T_LPC17xx_40xx_IOCON_ConfigList txd2[] = {
            {GPIO_P0_10, IOCON_D_DEFAULT(1)},
            {GPIO_P2_8,  IOCON_D_DEFAULT(2)},
            {GPIO_P4_22, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList rxd2[] = {
            {GPIO_P0_11, IOCON_D_DEFAULT(1)},
            {GPIO_P2_9,  IOCON_D_DEFAULT(2)},
            {GPIO_P4_23, IOCON_D_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART2", (T_halInterface *)&G_LPC17xx_40xx_Serial_UART2, 0,
            0);
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinTXD2, txd2, ARRAY_COUNT(txd2));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinRXD2, rxd2, ARRAY_COUNT(rxd2));
}

void LPC17xx_40xx_UART3_Require(
        T_uezGPIOPortPin aPinTXD3,
        T_uezGPIOPortPin aPinRXD3)
{
    static const T_LPC17xx_40xx_IOCON_ConfigList txd3[] = {
            {GPIO_P0_0,  IOCON_D_DEFAULT(2)},
            {GPIO_P0_2,  IOCON_D_DEFAULT(2)},
            {GPIO_P0_25, IOCON_A_DEFAULT(3)},
            {GPIO_P4_28, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList rxd3[] = {
            {GPIO_P0_1,  IOCON_D_DEFAULT(2)},
            {GPIO_P0_3,  IOCON_D_DEFAULT(2)},
            {GPIO_P0_26, IOCON_A_DEFAULT(3)},
            {GPIO_P4_29, IOCON_D_DEFAULT(2)},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART3", (T_halInterface *)&G_LPC17xx_40xx_Serial_UART3, 0,
            0);
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinTXD3, txd3, ARRAY_COUNT(txd3));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinRXD3, rxd3, ARRAY_COUNT(rxd3));
}

void LPC17xx_40xx_UART4_Require(
        T_uezGPIOPortPin aPinTXD4,
        T_uezGPIOPortPin aPinRXD4)
{
    static const T_LPC17xx_40xx_IOCON_ConfigList txd4[] = {
            {GPIO_P0_22,  IOCON_D_DEFAULT(3)},
            {GPIO_P1_29,  IOCON_D_DEFAULT(5)},
            {GPIO_P5_4,   IOCON_A_DEFAULT(4)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList rxd4[] = {
            {GPIO_P2_9,  IOCON_D_DEFAULT(3)},
            {GPIO_P5_3,  IOCON_D_DEFAULT(4)},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART4", (T_halInterface *)&G_LPC17xx_40xx_Serial_UART4, 0,
            0);
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinTXD4, txd4, ARRAY_COUNT(txd4));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aPinRXD4, rxd4, ARRAY_COUNT(rxd4));
}

/*-------------------------------------------------------------------------*
 * End of File:  SerialPorts.c
 *-------------------------------------------------------------------------*/
